refactor: split plugins and middlewares packages
